---
type: ExportUtils
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# ExportUtils

`Autodesk.Revit.DB.ExportUtils` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetExportId | — | `` |
| Method | GetGBXMLDocumentId | 2014 | `public static Guid GetGBXMLDocumentId ( Document document )` |
| Method | GetNurbsSurfaceDataForSurface | 2021 | `public static NurbsSurfaceData GetNurbsSurfaceDataForSurface ( Surface surface )` |